# data manipulation : 
 1. handling in data like adding, deleting and performing some task on it like remove null entries (clean and transform data) 
 2. organize and structure raw data
# data analysis : 
 1. getting insights from data like what is the highest marks and lowest marks like summrizing data is (generating insights from the data)
 2. finding the pattern, trends and solve problems

# series is 1d thing used with index
# dataframe is 2d thing used with row(indices) and column(names) and all pandas uses label things

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("hw_200.csv",encoding="latin-1")
print(df.head())

   Index   Height(Inches)"   "Weight(Pounds)"
0      1             65.78             112.99
1      2             71.52             136.49
2      3             69.40             153.03
3      4             68.22             142.34
4      5             67.79             144.30

In [3]:
df = pd.read_excel("sample_data.xlsx")
print(df)

    Name  Age Department  Salary
0    Avi   22         IT   50000
1   Riya   24         HR   55000
2  Karan   23    Finance   52000
3  Sneha   21  Marketing   51000
4  Arjun   25         IT   53000

In [4]:
df = pd.read_json("pandas_sample.json")
print(df)

   id   name  age       city  score
0   1    Avi   23      Delhi   88.5
1   2   Neha   25     Mumbai   92.0
2   3   Ravi   22  Bangalore   79.0
3   4  Sonia   24    Chennai   85.0
4   5  Karan   21       Pune   91.0

In [5]:
students_data = {
    "Name":["avi","ak","devil"],
    "age":[20,30,40],
    "city":["palanpur","gandhinagar","ahmedabad"]
}

df = pd.DataFrame(students_data)
print(df)
df.to_csv("output.csv",index=False)

    Name  age         city
0    avi   20     palanpur
1     ak   30  gandhinagar
2  devil   40    ahmedabad

In [6]:
df = pd.DataFrame(students_data)
print(df)
df.to_excel("output.xlsx",index=False)
df.to_json("output.json",index=False)

    Name  age         city
0    avi   20     palanpur
1     ak   30  gandhinagar
2  devil   40    ahmedabad

# steps in dataset to perform:
1. understand the data
2. identify the problem
3. plan the next step

1. to check first 5 entries from top .head(n) is used
2. to check first 5 entries from end .tail(n) is used
3. here by default value of n(int value must) is 5

# .info method is used to get the information about the data like
1. columns, rows
2. columns name
3. datatypes
4. memory usage

In [7]:
students_data2 = {
    "Name":["avi","ak","devil"],
    "age":[20,30,40],
    "city":["palanpur","gandhinagar","ahmedabad"]
}

df = pd.DataFrame(students_data2)
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   age     3 non-null      int64
 2   city    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes
None

# .describe method is used to gain details of data like mean,std,max and all

In [8]:
employees_data = {
    "name": ["Aarav", "Bhavya", "Chetan", "Divya", "Eshan", "Farah", "Gautam", "Hina"],
    "age": [28, 31, 24, 29, 26, 35, 33, 27],
    "salary": [55000, 60000, 48000, 62000, 53000, 71000, 67000, 50000],
    "performance_score": [82, 76, 91, 88, 69, 94, 85, 74]
}

df = pd.DataFrame(employees_data)
print(df.describe())

             age        salary  performance_score
count   8.000000      8.000000           8.000000
mean   29.125000  58250.000000          82.375000
std     3.681518   8172.252706           8.765802
min    24.000000  48000.000000          69.000000
25%    26.750000  52250.000000          75.500000
50%    28.500000  57500.000000          83.500000
75%    31.500000  63250.000000          88.750000
max    35.000000  71000.000000          94.000000

# we can access shape by .shape which includes (rows,columns) and .columns to get columns names

In [9]:
employees_data2 = {
    "name": ["Aarav", "Bhavya", "Chetan", "Divya", "Eshan", "Farah", "Gautam", "Hina"],
    "age": [28, 31, 24, 29, 26, 35, 33, 27],
    "salary": [55000, 60000, 48000, 62000, 53000, 71000, 67000, 50000],
    "performance_score": [82, 76, 91, 88, 69, 94, 85, 74]
}

df = pd.DataFrame(employees_data2)
print(df)
print(f'shape of it {df.shape}')
print(f'columns name {df.columns}')

     name  age  salary  performance_score
0   Aarav   28   55000                 82
1  Bhavya   31   60000                 76
2  Chetan   24   48000                 91
3   Divya   29   62000                 88
4   Eshan   26   53000                 69
5   Farah   35   71000                 94
6  Gautam   33   67000                 85
7    Hina   27   50000                 74
shape of it (8, 4)
columns name Index(['name', 'age', 'salary', 'performance_score'], dtype='object')

# to select columns
1. for single columns return series
2. for multiple columns return dataframe

In [10]:
employees_data3 = {
    "name": ["Aarav", "Bhavya", "Chetan", "Divya", "Eshan", "Farah", "Gautam", "Hina"],
    "age": [28, 31, 24, 29, 26, 35, 33, 27],
    "salary": [55000, 60000, 48000, 62000, 53000, 71000, 67000, 50000],
    "performance_score": [82, 76, 91, 88, 69, 94, 85, 74]
}

df = pd.DataFrame(employees_data3)
print("sample dataset")
print(df)
print('selecting single Name column')
print(df["name"]) # for single columns
print('selecting multiple Name, Age column')
print(df[["name","age"]]) # for multiple columns

sample dataset
     name  age  salary  performance_score
0   Aarav   28   55000                 82
1  Bhavya   31   60000                 76
2  Chetan   24   48000                 91
3   Divya   29   62000                 88
4   Eshan   26   53000                 69
5   Farah   35   71000                 94
6  Gautam   33   67000                 85
7    Hina   27   50000                 74
selecting single Name column
0     Aarav
1    Bhavya
2    Chetan
3     Divya
4     Eshan
5     Farah
6    Gautam
7      Hina
Name: name, dtype: object
selecting multiple Name, Age column
     name  age
0   Aarav   28
1  Bhavya   31
2  Chetan   24
3   Divya   29
4   Eshan   26
5   Farah   35
6  Gautam   33
7    Hina   27

In [11]:
employees_data4 = {
    "name": ["Aarav", "Bhavya", "Chetan", "Divya", "Eshan", "Farah", "Gautam", "Hina"],
    "age": [28, 31, 24, 29, 26, 35, 33, 27],
    "salary": [55000, 60000, 48000, 62000, 53000, 71000, 67000, 50000],
    "performance_score": [82, 76, 91, 88, 69, 94, 85, 74]
}

df = pd.DataFrame(employees_data4)
print("sample dataset")
print(df[df['salary']>50000]) # based on the condition extracting data

# age is 20 plus and salary is 60,000 plus
print("\nage is 20 plus and salary is 60,000")
print(df[(df["age"]>20) & (df["salary"]>60000)])

# age is 30 plus or performance_score > 90
print("\nage is 30 plus or performance_score > 90")
print(df[(df["age"] > 30) | (df["performance_score"] > 90)])

sample dataset
     name  age  salary  performance_score
0   Aarav   28   55000                 82
1  Bhavya   31   60000                 76
3   Divya   29   62000                 88
4   Eshan   26   53000                 69
5   Farah   35   71000                 94
6  Gautam   33   67000                 85

age is 20 plus and salary is 60,000
     name  age  salary  performance_score
3   Divya   29   62000                 88
5   Farah   35   71000                 94
6  Gautam   33   67000                 85

age is 30 plus or performance_score > 90
     name  age  salary  performance_score
1  Bhavya   31   60000                 76
2  Chetan   24   48000                 91
5   Farah   35   71000                 94
6  Gautam   33   67000                 85

# INSERT there is two way to add new coloumns in dataframe
1. using normal way like df["column_name"] = some_data
2. .insert method like .insert(location, "column_name", some_data)

In [ ]:
# way 1
employees_data5 = {
    "name": ["Aarav", "Bhavya", "Chetan", "Divya", "Eshan", "Farah", "Gautam", "Hina"],
    "age": [28, 31, 24, 29, 26, 35, 33, 27],
    "salary": [55000, 60000, 48000, 62000, 53000, 71000, 67000, 50000],
    "performance_score": [82, 76, 91, 88, 69, 94, 85, 74]
}

df = pd.DataFrame(employees_data5)
print("sample dataset")
df["bonus"] = df["salary"] * 0.1
print(df)

sample dataset
     name  age  salary  performance_score  bonus
0   Aarav   28   55000                 82      0
1  Bhavya   31   60000                 76      0
2  Chetan   24   48000                 91      0
3   Divya   29   62000                 88      0
4   Eshan   26   53000                 69      0
5   Farah   35   71000                 94      0
6  Gautam   33   67000                 85      0
7    Hina   27   50000                 74      0

In [16]:
# way 2
employees_data6 = {
    "name": ["Aarav", "Bhavya", "Chetan", "Divya", "Eshan", "Farah", "Gautam", "Hina"],
    "age": [28, 31, 24, 29, 26, 35, 33, 27],
    "salary": [55000, 60000, 48000, 62000, 53000, 71000, 67000, 50000],
    "performance_score": [82, 76, 91, 88, 69, 94, 85, 74]
}

df = pd.DataFrame(employees_data6)
print("sample dataset")
df.insert(0, "employee_id", range(1,9))
print(df)

sample dataset
   employee_id    name  age  salary  performance_score
0            1   Aarav   28   55000                 82
1            2  Bhavya   31   60000                 76
2            3  Chetan   24   48000                 91
3            4   Divya   29   62000                 88
4            5   Eshan   26   53000                 69
5            6   Farah   35   71000                 94
6            7  Gautam   33   67000                 85
7            8    Hina   27   50000                 74

# to update value in dataframe
1. .loc[row_index, "column_name"] = new_value
2. using local method like changing entire columns -> df["column_name"] = df["column_name"] * 1.05

In [ ]:
# way 1
employees_data7 = {
    "name": ["Aarav", "Bhavya", "Chetan", "Divya", "Eshan", "Farah", "Gautam", "Hina"],
    "age": [28, 31, 24, 29, 26, 35, 33, 27],
    "salary": [55000, 60000, 48000, 62000, 53000, 71000, 67000, 50000],
    "performance_score": [82, 76, 91, 88, 69, 94, 85, 74]
}

df = pd.DataFrame(employees_data7)
print("sample dataset")
print(df)
df.loc[2,"age"] = 40
print(df)

sample dataset
     name  age  salary  performance_score
0   Aarav   28   55000                 82
1  Bhavya   31   60000                 76
2  Chetan   24   48000                 91
3   Divya   29   62000                 88
4   Eshan   26   53000                 69
5   Farah   35   71000                 94
6  Gautam   33   67000                 85
7    Hina   27   50000                 74
     name  age  salary  performance_score
0   Aarav   28   55000                 82
1  Bhavya   31   60000                 76
2  Chetan   40   48000                 91
3   Divya   29   62000                 88
4   Eshan   26   53000                 69
5   Farah   35   71000                 94
6  Gautam   33   67000                 85
7    Hina   27   50000                 74

In [21]:
# way 2
employees_data7 = {
    "name": ["Aarav", "Bhavya", "Chetan", "Divya", "Eshan", "Farah", "Gautam", "Hina"],
    "age": [28, 31, 24, 29, 26, 35, 33, 27],
    "salary": [55000, 60000, 48000, 62000, 53000, 71000, 67000, 50000],
    "performance_score": [82, 76, 91, 88, 69, 94, 85, 74]
}

df = pd.DataFrame(employees_data7)
print("sample dataset")
print(df)
df["salary"] = df["salary"] * 1.05
print(df)

sample dataset
     name  age  salary  performance_score
0   Aarav   28   55000                 82
1  Bhavya   31   60000                 76
2  Chetan   24   48000                 91
3   Divya   29   62000                 88
4   Eshan   26   53000                 69
5   Farah   35   71000                 94
6  Gautam   33   67000                 85
7    Hina   27   50000                 74
     name  age   salary  performance_score
0   Aarav   28  57750.0                 82
1  Bhavya   31  63000.0                 76
2  Chetan   24  50400.0                 91
3   Divya   29  65100.0                 88
4   Eshan   26  55650.0                 69
5   Farah   35  74550.0                 94
6  Gautam   33  70350.0                 85
7    Hina   27  52500.0                 74

# to DROP the columns
1. df.drop(columns=["column_name"], inplace=True)
# inplace = true means it will remove from original dataframe
# inplace = false means it will firstly create copy of dataframe and then remove it

In [27]:
employees_data7 = {
    "name": ["Aarav", "Bhavya", "Chetan", "Divya", "Eshan", "Farah", "Gautam", "Hina"],
    "age": [28, 31, 24, 29, 26, 35, 33, 27],
    "salary": [55000, 60000, 48000, 62000, 53000, 71000, 67000, 50000],
    "performance_score": [82, 76, 91, 88, 69, 94, 85, 74]
}

df = pd.DataFrame(employees_data7)
print("sample dataset")
print(df)
print("after modification")
print(df.drop(columns=['performance_score',"age"], inplace=False)) # incase of copy we have to store it somewhere
df.drop(columns=['performance_score',"age"], inplace=True) # there is no need to store it somewhere when it comes to original
print(df)

sample dataset
     name  age  salary  performance_score
0   Aarav   28   55000                 82
1  Bhavya   31   60000                 76
2  Chetan   24   48000                 91
3   Divya   29   62000                 88
4   Eshan   26   53000                 69
5   Farah   35   71000                 94
6  Gautam   33   67000                 85
7    Hina   27   50000                 74
after modification
     name  salary
0   Aarav   55000
1  Bhavya   60000
2  Chetan   48000
3   Divya   62000
4   Eshan   53000
5   Farah   71000
6  Gautam   67000
7    Hina   50000
     name  salary
0   Aarav   55000
1  Bhavya   60000
2  Chetan   48000
3   Divya   62000
4   Eshan   53000
5   Farah   71000
6  Gautam   67000
7    Hina   50000

# Handling missing values

1. NaN(not a number)
2. None(for object data types)

# isnull()
1. True - Nan is missing
2. False - value is present

In [37]:
employees_data7 = {
    "name": ["Aarav", "Bhavya", None, "Divya", "Eshan", "Farah", "Gautam", "Hina"],
    "age": [28, 31, None, 29, 26, 35, 33, 27],
    "salary": [55000, 60000, None, 62000, 53000, 71000, 67000, 50000],
    "performance_score": [82, 76, None, 88, 69, 94, 85, 74]
}

df = pd.DataFrame(employees_data7)
print("sample dataset")
print(df)
print(df.isnull())
print(df.isnull().sum())

sample dataset
     name   age   salary  performance_score
0   Aarav  28.0  55000.0               82.0
1  Bhavya  31.0  60000.0               76.0
2    None   NaN      NaN                NaN
3   Divya  29.0  62000.0               88.0
4   Eshan  26.0  53000.0               69.0
5   Farah  35.0  71000.0               94.0
6  Gautam  33.0  67000.0               85.0
7    Hina  27.0  50000.0               74.0
    name    age  salary  performance_score
0  False  False   False              False
1  False  False   False              False
2   True   True    True               True
3  False  False   False              False
4  False  False   False              False
5  False  False   False              False
6  False  False   False              False
7  False  False   False              False
name                 1
age                  1
salary               1
performance_score    1
dtype: int64

# handling the missing value by droping that part

In [35]:
employees_data7 = {
    "name": ["Aarav", "Bhavya", None, "Divya", "Eshan", "Farah", "Gautam", "Hina"],
    "age": [28, 31, None, 29, 26, 35, 33, 27],
    "salary": [55000, 60000, None, 62000, 53000, 71000, 67000, 50000],
    "performance_score": [82, 76, None, 88, 69, 94, 85, 74]
}

df = pd.DataFrame(employees_data7)
print("sample dataset")
df.dropna(axis=0, inplace=True)
print(df)

sample dataset
     name   age   salary  performance_score
0   Aarav  28.0  55000.0               82.0
1  Bhavya  31.0  60000.0               76.0
3   Divya  29.0  62000.0               88.0
4   Eshan  26.0  53000.0               69.0
5   Farah  35.0  71000.0               94.0
6  Gautam  33.0  67000.0               85.0
7    Hina  27.0  50000.0               74.0

# handling the missing value by adding to some in that part

In [ ]:
# way 1 - by assinging 0 by default
employees_data7 = {
    "name": ["Aarav", "Bhavya", None, "Divya", "Eshan", "Farah", "Gautam", "Hina"],
    "age": [28, 31, None, 29, 26, 35, 33, 27],
    "salary": [55000, 60000, None, 62000, 53000, 71000, 67000, 50000],
    "performance_score": [82, 76, None, 88, 69, 94, 85, 74]
}

df = pd.DataFrame(employees_data7)
print("sample dataset")
df.fillna(0, inplace=True)
print(df)

sample dataset
     name   age   salary  performance_score
0   Aarav  28.0  55000.0               82.0
1  Bhavya  31.0  60000.0               76.0
2       0   0.0      0.0                0.0
3   Divya  29.0  62000.0               88.0
4   Eshan  26.0  53000.0               69.0
5   Farah  35.0  71000.0               94.0
6  Gautam  33.0  67000.0               85.0
7    Hina  27.0  50000.0               74.0

In [50]:
# way 1 - by assinging mean value by default
employees_data7 = {
    "name": ["Aarav", "Bhavya", None, "Divya", "Eshan", "Farah", "Gautam", "Hina"],
    "age": [28, 31, None, 29, 26, 35, 33, 27],
    "salary": [55000, 60000, None, 62000, 53000, 71000, 67000, 50000],
    "performance_score": [82, 76, None, 88, 69, 94, 85, 74]
}

df = pd.DataFrame(employees_data7)
print("sample dataset")
print(df)
df['name'].fillna("Unknown", inplace=True)
df['age'].fillna(round(df['age'].mean(),2), inplace=True)
df['salary'].fillna(round(df['salary'].mean(),2), inplace=True)
df['performance_score'].fillna(round(df['performance_score'].mean(),2), inplace=True)
print(df)

sample dataset
     name   age   salary  performance_score
0   Aarav  28.0  55000.0               82.0
1  Bhavya  31.0  60000.0               76.0
2    None   NaN      NaN                NaN
3   Divya  29.0  62000.0               88.0
4   Eshan  26.0  53000.0               69.0
5   Farah  35.0  71000.0               94.0
6  Gautam  33.0  67000.0               85.0
7    Hina  27.0  50000.0               74.0
      name    age    salary  performance_score
0    Aarav  28.00  55000.00              82.00
1   Bhavya  31.00  60000.00              76.00
2  Unknown  29.86  59714.29              81.14
3    Divya  29.00  62000.00              88.00
4    Eshan  26.00  53000.00              69.00
5    Farah  35.00  71000.00              94.00
6   Gautam  33.00  67000.00              85.00
7     Hina  27.00  50000.00              74.00

C:\Users\arthv\AppData\Local\Temp\ipykernel_24696\1218579359.py:12: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['name'].fillna("Unknown", inplace=True)
C:\Users\arthv\AppData\Local\Temp\ipykernel_24696\1218579359.py:13: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(round(df['age'].mean(),2), inplace=True)
C:\Users\arthv\AppData\Local\Temp\ipykernel_24696\1218579359.py:14: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['salary'].fillna(round(df['salary'].mean(),2), inplace=True)
C:\Users\arthv\AppData\Local\Temp\ipykernel_24696\1218579359.py:15: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['performance_score'].fillna(round(df['performance_score'].mean(),2), inplace=True)

# interpolation: adding estimated value to none data like
10,20,none,40,50 and here instead of none, 30 is added
1. it will preserve data integrity
2. smooth trends
3. avoid data loss
4. it uses linear, polynomial, time method and .interpolate() method is used
5. works with time and numerical data

In [53]:
employees_data7 = {
    "name": ["Aarav", "Bhavya", "avi", "Divya", "Eshan", "Farah", "Gautam", "Hina"],
    "age": [28, 31, None, 29, 26, 35, 33, 27],
    "salary": [55000, 60000, None, 62000, 53000, 71000, 67000, 50000],
    "performance_score": [82, 76, None, 88, 69, 94, 85, 74]
}

df = pd.DataFrame(employees_data7)
print("sample dataset")
print(df)
df.interpolate(method="linear",axis = 0, inplace=True)
print(df)

sample dataset
     name   age   salary  performance_score
0   Aarav  28.0  55000.0               82.0
1  Bhavya  31.0  60000.0               76.0
2     avi   NaN      NaN                NaN
3   Divya  29.0  62000.0               88.0
4   Eshan  26.0  53000.0               69.0
5   Farah  35.0  71000.0               94.0
6  Gautam  33.0  67000.0               85.0
7    Hina  27.0  50000.0               74.0
     name   age   salary  performance_score
0   Aarav  28.0  55000.0               82.0
1  Bhavya  31.0  60000.0               76.0
2     avi  30.0  61000.0               82.0
3   Divya  29.0  62000.0               88.0
4   Eshan  26.0  53000.0               69.0
5   Farah  35.0  71000.0               94.0
6  Gautam  33.0  67000.0               85.0
7    Hina  27.0  50000.0               74.0

C:\Users\arthv\AppData\Local\Temp\ipykernel_24696\367849293.py:11: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(method="linear",axis = 0, inplace=True)

In [55]:
timezone = {
  "time":[1,2,3,4,5],
  "value":[10,20,None,40,None]
}

df = pd.DataFrame(timezone)
df['value'] = df['value'].interpolate(method="linear")
print(df)

   time  value
0     1   10.0
1     2   20.0
2     3   30.0
3     4   40.0
4     5   40.0

# sorting data based on the requirements like in abcd manner 
1. to sort one column -> df.sort_values(by="column_name",true/false, inplace=true) -> true:ascending manner, false:descending manner

In [61]:
# way-1
data = {
  "name":['avi','kavi','ravi'],
  "age":[5,9,6],
  "salary":[500,800,600]
}

df = pd.DataFrame(data)
df.sort_values(by="salary",ascending=False, inplace=True)
print(df)

   name  age  salary
1  kavi    9     800
2  ravi    6     600
0   avi    5     500

In [67]:
# way-2
data = {
  "name":['avi','kavi','ravi'],
  "age":[5,9,6],
  "salary":[5020,800,6100]
}

df = pd.DataFrame(data)
df.sort_values(by=["age","salary"],ascending=[True, False], inplace=True)
print(df)

   name  age  salary
0   avi    5    5020
2  ravi    6    6100
1  kavi    9     800

# aggregation : summarizing things using some operation on it
1. e.g.df["column_name"].mean()

In [76]:
data = {
  "name":['avi','kavi','ravi'],
  "age":[5,9,6],
  "salary":[5020,800,6100]
}

df = pd.DataFrame(data)
avg = df["salary"].mean()
print(avg)

3973.3333333333335

# grouping : making group of things based on their category like apple, banana, watermelon

In [81]:
data = {
  "name":['avi','kavi','ravi','kiki','kaku','keval'],
  "age":[5,9,6,9,8,5],
  "salary":[5020,800,6100,500,652,741]
}

df = pd.DataFrame(data)
group = df.groupby("age")["salary"].sum()
print(group)

age
5    5761
6    6100
8     652
9    1300
Name: salary, dtype: int64

In [83]:
data = {
  "name":['avi','kavi','ravi','kiki','kaku','keval'],
  "age":[5,9,6,9,8,5],
  "salary":[5020,800,6100,500,652,741]
}

df = pd.DataFrame(data)
group = df.groupby(["age","name"])["salary"].sum()
print(group)

age  name
5    avi      5020
     keval     741
6    ravi     6100
8    kaku      652
9    kavi      800
     kiki      500
Name: salary, dtype: int64

# merging : merging take place based on common between two columns
1. df.merge(df1, df2, on="common_column_name", how="types of join")

In [97]:
data1 = pd.DataFrame({
  "custom_id":[1,2,3],
  "name":["avi","raju","kaju"]
})

data2 = pd.DataFrame({
  "custom_id":[1,2,4],
  "salary":[500,600,960]
})

merged = pd.merge(data1,data2, on="custom_id", how="inner")
print(merged)

   custom_id  name  salary
0          1   avi     500
1          2  raju     600

# concatination : joining two dataframes in one
1. df.concat([df1, df2], axis=0/1, ignore_index = True/False)
2. ignore_index = True -> means not consider index of two and False then consider

In [99]:
data1 = pd.DataFrame({
  "custom_id":[1,2,3],
  "name":["avi","raju","kaju"]
})

data2 = pd.DataFrame({
  "custom_id":[4,5,6],
  "name":["sajan","gimmi","devil"]
})

con = pd.concat([data1,data2],axis=1, ignore_index=True)
print(con)

   0     1  2      3
0  1   avi  4  sajan
1  2  raju  5  gimmi
2  3  kaju  6  devil